modules/orders/classes/orders/OrdersGetter.php

    public function getPaginationList()
    {
        $query = Orders::find();

        $query->with(['users','services']);

        $this->filter($query);

        $pagination = new Pagination([
            'defaultPageSize' => Yii::$app->getModule('orders')->params['pagination']['per_page'],
            'pageSizeLimit' => [1, 100],
            'totalCount' => $query->count(),
        ]);

        $query->offset($pagination->offset)
            ->limit($pagination->limit);

        return [
            'orders' => $query->all(),
            'pagination' => $pagination,
        ];
---
SELECT COUNT(*) FROM `orders`
SELECT * FROM `orders` ORDER BY `orders`.`id` DESC LIMIT 100 OFFSET 100
SELECT * FROM `services` WHERE `id` IN (5, 9, 14, 12, 15, 11, 3, 10, 17, 16, 6, 4, 13, 7, 8, 2, 1)
SELECT * FROM `users` WHERE `id` IN (92, 17, 27, 57, 99, 84, 41, 56, 10, 12, 53, 55, 24, 83, 22, 85, 20, 59, 75, 94, 73, 35, 7, 61, 67, 42, 23, 93, 54, 15, 16, 65, 11, 39, 72, 81, 88, 46, 1, 18, 48, 69, 45, 50, 82, 64, 6, 19, 34, 97, 80, 86, 68, 63, 58, 49, 44, 76, 37, 14, 38, 32, 28)