modules/orders/classes/services/ServicesGetter.php

    protected function getList()
    {
        $query = (new Query());
        $query->select(['services.id as id, services.name as name, COUNT(orders.id) as count'])
            ->from('services')
            ->rightJoin('orders', '`orders`.`service_id` = `services`.`id`');

        $this->filter($query);

        return $query->groupBy('orders.service_id')
            ->all();
---
SELECT services.id as id, services.name as name, COUNT(orders.id) AS `count` FROM `services` RIGHT JOIN `orders` ON `orders`.`service_id` = `services`.`id` GROUP BY `orders`.`service_id`